burgrp/py32-svd/svd/py32md420xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP2</name>
      <description>Comparator</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010210</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>COMP_EN</name>
              <description>COMP enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INMSEL</name>
              <description>Comparator signal selector for inverting input INM</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>INPSEL</name>
              <description>Comparator signal selector for non-inverting input</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>WINMODE</name>
              <description>Comparator non-inverting input selector for window mode</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>POLARITY</name>
              <description>Comparator polarity selector</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>HYST</name>
              <description>Comparator hysteresis enable selector</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>Comparator power mode selector</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>VCDIV</name>
              <description>Comparator vcdiv</description>
              <bitRange>[25:20]</bitRange>
            </field>
            <field>
              <name>VCDIV_EN</name>
              <description>Comparator vcdiv enable</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>VCSEL</name>
              <description>Comparator vcsel</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>COMP_OUT</name>
              <description>Comparator output status</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>CSR register lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <displayName>FR</displayName>
          <description>Comparator Filterregister</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FLTEN</name>
              <description>Filter enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLTCNT</name>
              <description>Comparator filter and counter</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CORDIC</name>
      <description>Digital Co-process Operation</description>
      <groupName>CORDIC</groupName>
      <baseAddress>0x40023400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SQRT</name>
        <description>SQRT global Interrupt</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>CORDIC</name>
        <description>CORDIC global Interrupt</description>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>CORDIC control register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>ITERATION</name>
              <description>desc ITERATION</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>CORDIC_INT</name>
              <description>desc CORDIC_INT</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SQRT_INT</name>
              <description>desc SQRT_INT</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CORDIC_MODE</name>
              <description>desc CORDIC_MODE</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>START</name>
              <description>desc START</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>START_MODE</name>
              <description>desc START_MODE</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>VECSIZE</name>
              <description>desc VECSIZE</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>RESSIZE</name>
              <description>desc RESSIZE</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ARGSIZE</name>
              <description>desc ARGSIZE</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CORDIC_INT_MASK</name>
              <description>desc CORDIC_INT_MASK</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SQRT_INT_MASK</name>
              <description>desc SQRT_INT_MASK</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CORDIC_ERROR_INT_MASK</name>
              <description>desc CORDIC_ERROR_INT_MASK</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ARCTAN_MOD_OV_MASK</name>
              <description>desc ARCTAN_MOD_OV_MASK</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>THETA</name>
          <displayName>THETA</displayName>
          <description>SIN or COS input theta register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>THETA</name>
              <description>THETA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SIN</name>
          <displayName>SIN</displayName>
          <description>CORDIC SIN result register</description>
          <addressOffset>0x8</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>SIN</name>
              <description>SIN result</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COS</name>
          <displayName>COS</displayName>
          <description>CORDIC COS result register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>COS</name>
              <description>COS result</description>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>X</name>
          <displayName>X</displayName>
          <description>Arctan input coordinate register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>X</name>
              <description>arctan or module X register</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>Y</name>
          <displayName>Y</displayName>
          <description>Arctan input coordinate register</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>Y</name>
              <description>arctan or module Y register</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MOD</name>
          <displayName>MOD</displayName>
          <description>CORDIC Mod result register</description>
          <addressOffset>0x18</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>MOD</name>
              <description>mod result</description>
              <bitRange>[24:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ARCTAN</name>
          <displayName>ARCTAN</displayName>
          <description>CORDIC ARCTAN result register</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ARCTAN</name>
              <description>arctan result</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DSP_RAD</name>
          <displayName>DSP_RAD</displayName>
          <description>CORDIC Radicand register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>RAD</name>
              <description>Number of open parties</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DSP_SQRT</name>
          <displayName>DSP_SQRT</displayName>
          <description>CORDIC SQRT result register</description>
          <addressOffset>0x24</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>SQRT</name>
              <description>sqrt result</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>CORDIC Status register</description>
          <addressOffset>0x28</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CCFF</name>
              <description>desc CCFF</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCFF</name>
              <description>desc SCFF</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CCEF</name>
              <description>desc CCFF</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ACEF</name>
              <description>desc ACFF</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BSY</name>
              <description>desc BSY</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
